Chanartip/TM4C123HomeAutomation/src/lib/UART.c
/*
Name:			Chanartip Soonthornwan
					Samuel Poff
Email:	  Chanartip.Soonthornwan@gmail.com
					Spoff42@gmail.com
Project:  Project2_part2_UART
Filename: UART.c
Revision 1.1: Date: 3/21/2018
Updated:  Edit UART_Init to initialize UART_1 instead of UART_0
				  
*/
// U0Rx (VCP receive) connected to PA0
// U0Tx (VCP transmit) connected to PA1

#include "UART.h"
#include "tm4c123gh6pm.h"

#define UART_FR_TXFF            0x00000020  // UART Transmit FIFO Full
#define UART_FR_RXFE            0x00000010  // UART Receive FIFO Empty
#define UART_LCRH_WLEN_8        0x00000060  // 8 bit word length
#define UART_LCRH_FEN           0x00000010  // UART Enable FIFOs
#define UART_CTL_UARTEN         0x00000001  // UART Enable

//------------UART0_Init------------
// Initialize the UART for 115,200 baud rate (assuming 50 MHz UART clock),
// 8 bit word length, no parity bits, one stop bit, FIFOs enabled
void UART0_Init(void){
  SYSCTL_RCGC1_R |= SYSCTL_RCGC1_UART0; // activate UART0
  SYSCTL_RCGC2_R |= SYSCTL_RCGC2_GPIOA; // activate port A
  UART0_CTL_R &= ~UART_CTL_UARTEN;      // disable UART
  UART0_IBRD_R = 27;                   // IBRD = int(50,000,000 / (16 * 115,200)) = int(27.1267)
  UART0_FBRD_R = 8;                    // FBRD = int(0.1267 * 64 + 0.5) = 8
                                        // 8 bit word length (no parity bits, one stop bit, FIFOs)
  UART0_LCRH_R = (UART_LCRH_WLEN_8|UART_LCRH_FEN);
  UART0_CTL_R |= UART_CTL_UARTEN;       // enable UART
  GPIO_PORTA_AFSEL_R |= 0x03;           // enable alt funct on PA1-0
  GPIO_PORTA_DEN_R   |= 0x03;           // enable digital I/O on PA1-0
                                        // configure PA1-0 as UART
  GPIO_PORTA_PCTL_R = (GPIO_PORTA_PCTL_R&0xFFFFFF00)+0x00000011;
  GPIO_PORTA_AMSEL_R &= ~0x03;          // disable analog functionality on PA
}
// Uart 1, 38400 Baud, 8 Bit, No Parity. 
// IBRD = 50,000,000/ (16*38400) = 81.3802
// FBRD = .3802 * 64 + 0.5 = 24.8328
// void UART1_Init(void) {
//     SYSCTL_RCGC1_R     |=  0x02;       // activate UART1
//     SYSCTL_RCGCGPIO_R  |=  0x02;       // activate port B
//     while((SYSCTL_PRGPIO_R&0x02) == 0){};    
//     UART1_CTL_R        &= ~0x01;       // disable UART
//     UART1_IBRD_R        =  81;        // IBRD, 50Mhz clk, 9600 baud
//     UART1_FBRD_R        =  24;         // FBRD
//     UART1_LCRH_R        =  0x70;       // 8 bit(no parity, one stop, FIFOs)
//     UART1_CTL_R        |=  0x01;       // enable UART
//     GPIO_PORTB_AFSEL_R |=  0x03;       // enable alt funct on PB0, PB1
//     GPIO_PORTB_PCTL_R  &= ~0x000000FF; // configure PB0 as U1Rx and PB1 as U1Tx
//     GPIO_PORTB_PCTL_R  |=  0x00000011;
//     GPIO_PORTB_AMSEL_R &= ~0x03;       // disable analog funct on PB0, PB1
//     GPIO_PORTB_DEN_R   |=  0x03;       // enable digital I/O on PB0, PB1
// }
// if 9600, IBRD=325, FBRD=33
 void UART1_Init(void) {
     SYSCTL_RCGC1_R     |=  0x02;       // activate UART1
     SYSCTL_RCGCGPIO_R  |=  0x02;       // activate port B
     while((SYSCTL_PRGPIO_R&0x02) == 0){};    
     UART1_CTL_R        &= ~0x01;       // disable UART
     UART1_IBRD_R        =  325;        // IBRD, 50Mhz clk, 9600 baud
     UART1_FBRD_R        =  33;         // FBRD
     UART1_LCRH_R        =  0x70;       // 8 bit(no parity, one stop, FIFOs)
     UART1_CTL_R        |=  0x01;       // enable UART
     GPIO_PORTB_AFSEL_R |=  0x03;       // enable alt funct on PB0, PB1
     GPIO_PORTB_PCTL_R  &= ~0x000000FF; // configure PB0 as U1Rx and PB1 as U1Tx
     GPIO_PORTB_PCTL_R  |=  0x00000011;
     GPIO_PORTB_AMSEL_R &= ~0x03;       // disable analog funct on PB0, PB1
     GPIO_PORTB_DEN_R   |=  0x03;       // enable digital I/O on PB0, PB1
 }
// if 57600, IBRD=54, FBRD=16
//void UART1_Init(void) {
//    SYSCTL_RCGC1_R     |=  0x02;       // activate UART1
//    SYSCTL_RCGCGPIO_R  |=  0x02;       // activate port B
//    while((SYSCTL_PRGPIO_R&0x02) == 0){};    
//    UART1_CTL_R        &= ~0x01;       // disable UART
//    UART1_IBRD_R        =  54;         // IBRD, 50Mhz clk, 57600 baud
//    UART1_FBRD_R        =  16;         // FBRD
//    UART1_LCRH_R        =  0x70;       // 8 bit(no parity, one stop, FIFOs)
//    UART1_CTL_R        |=  0x01;       // enable UART
//    GPIO_PORTB_AFSEL_R |=  0x03;       // enable alt funct on PB0, PB1
//    GPIO_PORTB_PCTL_R  &= ~0x000000FF; // configure PB0 as U1Rx and PB1 as U1Tx
//    GPIO_PORTB_PCTL_R  |=  0x00000011;
//    GPIO_PORTB_AMSEL_R &= ~0x03;       // disable analog funct on PB0, PB1
//    GPIO_PORTB_DEN_R   |=  0x03;       // enable digital I/O on PB0, PB1
//}

//------------UART_InChar------------
// Wait for new serial port input
// Input: none
// Output: ASCII code for key typed
unsigned char UART0_InChar(void){
  while((UART0_FR_R&UART_FR_RXFE) != 0);
  return((unsigned char)(UART0_DR_R&0xFF));
}
unsigned char UART1_InChar(void){
  while((UART1_FR_R&UART_FR_RXFE) != 0);
  return((unsigned char)(UART1_DR_R&0xFF));
}

//------------UART_OutChar------------
// Output 8-bit to serial port
// Input: letter is an 8-bit ASCII character to be transferred
// Output: none
void UART0_OutChar(unsigned char data){
  while((UART0_FR_R&UART_FR_TXFF) != 0);
  UART0_DR_R = data;
}
void UART1_OutChar(unsigned char data){
  while((UART1_FR_R&UART_FR_TXFF) != 0);
  UART1_DR_R = data;
}

//------------UART_OutString------------
// Output String (NULL termination)
// Input: pointer to a NULL-terminated string to be transferred
// Output: none
void UART0_OutString(char *pt){
  while(*pt){
    UART0_OutChar(*pt);
    pt++;
  }
}
void UART1_OutString(char *pt){
  while(*pt){
    UART1_OutChar(*pt);
    pt++;
  }
}


//-----------------------UART_OutUDec-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
void UART0_OutUDec(unsigned long n){
// This function uses recursion to convert decimal number
//   of unspecified length as an ASCII string
  if(n >= 10){
    UART0_OutUDec(n/10);
    n = n%10;
  }
  UART0_OutChar(n+'0'); /* n is between 0 and 9 */
}
void UART1_OutUDec(unsigned long n){
// This function uses recursion to convert decimal number
//   of unspecified length as an ASCII string
  if(n >= 10){
    UART1_OutUDec(n/10);
    n = n%10;
  }
  UART1_OutChar(n+'0'); /* n is between 0 and 9 */
}
//------------UART0_InString------------
// Accepts ASCII characters from the serial port
//    and adds them to a string until <enter> is typed
//    or until max length of the string is reached.
// It echoes each character as it is inputted.
// If a backspace is inputted, the string is modified
//    and the backspace is echoed
// terminates the string with a null character
// uses busy-waiting synchronization on RDRF
// Input: pointer to empty buffer, size of buffer
// Output: Null terminated string
// -- Modified by Agustinus Darmawan + Mingjie Qiu --
void UART0_InString(char *bufPt, unsigned short max) {
int length=0;
char character;
  character = UART0_InChar();
  while(character != CR){
    if(character == BS){
      if(length){
        bufPt--;
        length--;
//        UART0_OutChar(BS);
      }
    }
    else if(length < max){
      *bufPt = character;
      bufPt++;
      length++;
//      UART0_OutChar(character);
    }
    character = UART0_InChar();
  }
  *bufPt = 0;
}
void UART1_InString(char *bufPt, unsigned short max) {
int length=0;
char character;
  character = UART1_InChar();
  while(character != CR){
    if(character == BS){
      if(length){
        bufPt--;
        length--;
//        UART0_OutChar(BS);
      }
    }
    else if(length < max){
      *bufPt = character;
      bufPt++;
      length++;
//      UART0_OutChar(character);
    }
    character = UART1_InChar();
  }
  *bufPt = 0;
}

//------------UART_InUDec------------
// InUDec accepts ASCII input in unsigned decimal format
//     and converts to a 32-bit unsigned number
//     valid range is 0 to 4294967295 (2^32-1)
// Input: none
// Output: 32-bit unsigned number
// If you enter a number above 4294967295, it will return an incorrect value
// Backspace will remove last digit typed
unsigned long UART0_InUDec(void){
unsigned long number=0, length=0;
char character;
  character = UART0_InChar();
  while(character != CR){ // accepts until <enter> is typed
// The next line checks that the input is a digit, 0-9.
// If the character is not 0-9, it is ignored and not echoed
    if((character>='0') && (character<='9')) {
      number = 10*number+(character-'0');   // this line overflows if above 4294967295
      length++;
//      UART1_OutChar(character);
    }
// If the input is a backspace, then the return number is
// changed and a backspace is outputted to the screen
    else if((character==BS) && length){
      number /= 10;
      length--;
//      UART0_OutChar(character);
    }
    character = UART0_InChar();
  }
  return number;
}

unsigned long UART1_InUDec(void){
unsigned long number=0, length=0;
char character;
  character = UART1_InChar();
  while(character != CR){ // accepts until <enter> is typed
// The next line checks that the input is a digit, 0-9.
// If the character is not 0-9, it is ignored and not echoed
    if((character>='0') && (character<='9')) {
      number = 10*number+(character-'0');   // this line overflows if above 4294967295
      length++;
//      UART1_OutChar(character);
    }
// If the input is a backspace, then the return number is
// changed and a backspace is outputted to the screen
    else if((character==BS) && length){
      number /= 10;
      length--;
//      UART1_OutChar(character);
    }
    character = UART1_InChar();
  }
  return number;
}


//------------UART_NonBlockingInChar------------
// Get serial port input and return immediately
// Input: none
// Output: ASCII code for key typed or 0 if no character
unsigned char UART0_NonBlockingInChar(void)
{
  if((UART0_FR_R&UART_FR_RXFE) == 0)
  {
    return((unsigned char)(UART0_DR_R&0xFF));
  } 
  else
  {
    return 0;
  }
}
unsigned char UART1_NonBlockingInChar(void)
{
  if((UART1_FR_R&UART_FR_RXFE) == 0)
  {
    return((unsigned char)(UART1_DR_R&0xFF));
  } 
  else
  {
    return 0;
  }
}
